# Serie a partir de uma lista

In [198]:
dados = [1,2,3,4,5]
type(dados)

list

In [199]:
dados

[1, 2, 3, 4, 5]

In [200]:
import pandas as pd
s = pd.Series(dados)

In [201]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [202]:
type(s)

pandas.core.series.Series

In [203]:
s.describe() #serie nao tem atributo INFO()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [204]:
indice = ['Linha ' + str(i) for i in range(5)]

In [205]:
indice

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [206]:
s = pd.Series(data = dados, index = indice)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

# Serie a partir de um dicionário

In [207]:
dados2 = {'Linha ' + str(i) : i + 1 
          for i in range(5)}

In [208]:
dados2

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [209]:
s2 = pd.Series(dados2)
s2

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [210]:
s3 = s2 + 2 #Podemos fazer operações em nossa Series:
s3

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

# DataFrame a partir de uma lista

In [211]:
dados3 = [[1,2,3], [4,5,6], [7,8,9]]
type(dados3)

list

In [212]:
df1 = pd.DataFrame(dados3)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [213]:
indice = ['Linha ' + str(i) for i in range(3)]
indice

['Linha 0', 'Linha 1', 'Linha 2']

In [214]:
df1 = pd.DataFrame(data = dados3, index = indice)
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [215]:
df1.columns=["Col1", "Col2", "Col3"] #poderia ter feito columa = ['Coluna ' + str(i) for i in range(3)]
df1.columns.name='Índice'
df1

Índice   Col1  Col2  Col3
Linha 0     1     2     3
Linha 1     4     5     6
Linha 2     7     8     9

# DataFrame a partir de Dicionário

In [216]:
data11 = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
type(data11)

dict

In [217]:
df3 = pd.DataFrame(data11)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

# DataFrame a partir de Tupla

In [218]:
data12 = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
type(data12)

list

In [230]:
data12
df4 = pd.DataFrame(data12, index = indice)
df4

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [220]:
#Ao longo do curso, aprenderemos a concatenar DataFrames, mas por ora faremos uma modificação simples em df1. 
#Para os valores maiores que 0, será atribuída a nomação A.

In [221]:
type(df1)

pandas.core.frame.DataFrame

In [222]:
df1[df1> 0] = 'A'
df1

Índice  Col1 Col2 Col3
Linha 0    A    A    A
Linha 1    A    A    A
Linha 2    A    A    A

In [223]:
df4[df4 > 0] = 'B'
df4

   0  1  2
0  B  B  B
1  B  B  B
2  B  B  B

In [231]:
df4.columns=["Col1", "Col2", "Col3"]

In [232]:
df5 = pd.concat([df1, df4])
df5

        Col1 Col2 Col3
Linha 0    A    A    A
Linha 1    A    A    A
Linha 2    A    A    A
Linha 0    1    2    3
Linha 1    4    5    6
Linha 2    7    8    9

 ### Também podemos fazer a ligação entre tabelas se dar pelas linhas, e não pelas colunas.

In [233]:
df6 = pd.concat([df1, df4], axis = 1)
df6

         Col1  Col2  Col3  Col1  Col2  Col3
Linha 0     A     A     A     1     2     3
Linha 1     A     A     A     4     5     6
Linha 2     A     A     A     7     8     9